kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_7_3/ESP32-S3-Station-V_7_7_3.ino
void drawHoldProgressHUD(unsigned long holdDur) {
  int boxX = 6, boxY = 100, boxW = 160, boxH = 100;
  tft.fillRoundRect(boxX, boxY, boxW, boxH, 8, THEME_NAVY);
  tft.drawRoundRect(boxX, boxY, boxW, boxH, 8, THEME_CYAN);

  int barX = boxX + 15;
  int barY = boxY + 48;
  int barW = 130;
  int barH = 12;

  if (holdDur < 3000) {
    int fill = map(holdDur, 400, 3000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;

    drawCenteredString("BUTTON HOLDING", boxY + 12, 1, THEME_SKYBLUE, THEME_NAVY);
    drawCenteredString("-> SENSOR CHECK (3s)", boxY + 28, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_PINK);
    drawCenteredString("Release <3s = Cancel", boxY + 82, 1, ST77XX_LIGHTGREY, THEME_NAVY);
  }
  else if (holdDur < 5000) {
    int fill = map(holdDur, 3000, 5000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;

    drawCenteredString("RELEASE = CHECK", boxY + 12, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("-> CREDITS (5s)", boxY + 28, 1, THEME_PINK, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_CYAN);
  }
  else {
    drawCenteredString(">> CREDITS READY <<", boxY + 14, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("RELEASE TO VIEW", boxY + 30, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, barW - 2, barH - 2, COLOR_GREEN);
  }
}

// ============================================================================
// เชื่อมตัวตรวจจับหยด (drop_detector.h) เข้ากับส่วนอื่นของเฟิร์มแวร์
// ตัวอัลกอริทึมทั้งหมดอยู่ในไฟล์นั้น ไฟล์นี้ทำแค่ป้อนค่า ADC เข้าไปและรับผลออกมา
// ============================================================================
iv::DropDetector detector;

int  sensorRaw      = 0;     // ค่าดิบล่าสุด (ไว้แสดงผล)
bool sensorHasDrops = false; // เคยจับหยดได้แล้วอย่างน้อย 1 หยด


// ----------------------------------------------------------------------------
// หน้าต่างคำนวณอัตราการไหล (ใหม่ใน v7.7.3)
// ----------------------------------------------------------------------------
// เดิมใช้ค่าเฉลี่ยถ่วงน้ำหนักของ "อัตราขณะนั้น" (60000/dt) ซึ่งเป็นการเฉลี่ย
// ส่วนกลับของเวลา ตามอสมการเจนเซนจะให้ค่าสูงกว่าความจริงเสมอ และแกว่งแรงตาม
// ความไม่สม่ำเสมอตามธรรมชาติของหยด จนหลุดกรอบ +-10% ที่คู่มือใช้คาลิเบรต
// (ตัวอย่าง: หยดสลับ 1.0/1.4 วินาที ของจริง 150 mL/h จอแกว่ง 139-170 mL/h)
//
// ใหม่: นับจำนวนหยดที่ตกจริงในหน้าต่าง แล้วหารด้วยเวลาที่ใช้ไปทั้งหน้าต่าง
//   mL/h = (จำนวนหยดในหน้าต่าง / Drop Factor) x 3,600,000 / ช่วงเวลา(ms)
// เป็นวิธีเดียวกับที่พยาบาลนับหยด 1 นาทีตามคู่มือ และเดียวกับที่ Host บันทึก
// ลง Log รายนาที ตัวเลขทั้งสามจุดจึงตรงกันโดยนิยาม และไม่มีค่าเอน
#define RATE_WINDOW_DROPS   8

unsigned long rateWinMs[RATE_WINDOW_DROPS] = {0};
uint8_t       rateWinIdx   = 0;
uint8_t       rateWinCount = 0;

void resetRateWindow() {
  rateWinIdx   = 0;
  rateWinCount = 0;
}

void pushRateSample(unsigned long t) {
  rateWinMs[rateWinIdx] = t;
  rateWinIdx = (uint8_t)((rateWinIdx + 1) % RATE_WINDOW_DROPS);
  if (rateWinCount < RATE_WINDOW_DROPS) rateWinCount++;
}

// ช่วงเวลาทั้งหน้าต่าง (ms) — 0 = ยังมีตัวอย่างไม่พอ
unsigned long rateWindowSpanMs() {
  if (rateWinCount < 2) return 0;
  uint8_t oldest = (uint8_t)((rateWinIdx + RATE_WINDOW_DROPS - rateWinCount) % RATE_WINDOW_DROPS);
  uint8_t newest = (uint8_t)((rateWinIdx + RATE_WINDOW_DROPS - 1) % RATE_WINDOW_DROPS);
  return rateWinMs[newest] - rateWinMs[oldest];
}

// ช่วงห่างเฉลี่ยระหว่างหยดในหน้าต่าง (ms) — 0 = ยังคำนวณไม่ได้
unsigned long rateWindowMeanIntervalMs() {
  unsigned long span = rateWindowSpanMs();
  if (span == 0) return 0;
  return span / (unsigned long)(rateWinCount - 1);
}

// อัตราการไหลจากหน้าต่าง (mL/h) — 0 = ยังคำนวณไม่ได้
// N ตัวอย่างเวลา = N-1 ช่วง = มีหยดตกจริง N-1 หยดในช่วงเวลานั้น
float rateFromWindow(uint8_t df) {
  unsigned long span = rateWindowSpanMs();
  if (span == 0 || df == 0) return 0.0f;
  float dropsInSpan = (float)(rateWinCount - 1);
  return (dropsInSpan / (float)df) * 3600000.0f / (float)span;
}

// นำผลของหยด 1 หยดไปคำนวณอัตราไหล/ปริมาตร (v7.7.3: อัตราไหลคิดจากหน้าต่างเวลาสะสม)
void onDropDetected() {
  unsigned long now = millis();
  totalDrops++;
  periodDropsCounter++;
  sensorHasDrops = true;

  isDropFalling = true;
  dropFallStartTime = now;
  animDropY = CHAMBER_NOZZLE_Y;

  uint8_t df = safeDropFactor(dropFactor);

  // ---- สะสมต่อในหน้าต่างเดิม หรือเริ่มหน้าต่างใหม่? ----
  if (!hasFirstDropOccurred || skipNextInterval) {
    resetRateWindow();            // เริ่มถุงใหม่/กลับจากหยุดชั่วคราว: ช่วงที่ขาดหายไม่ใช่การไหล
  } else {
    unsigned long dropDeltaMs = now - lastDropTimestamp;
    unsigned long meanIv      = rateWindowMeanIntervalMs();
    if (dropDeltaMs <= minDropInterval || dropDeltaMs >= MAX_OCCLUSION_MS) {
      resetRateWindow();          // ช่วงหยดผิดปกติ ไม่เอามาปนกับของเดิม
    } else if (meanIv > 0 && (dropDeltaMs > meanIv * 3 || dropDeltaMs * 3 < meanIv)) {
      resetRateWindow();          // อัตราเปลี่ยนก้าวกระโดด (หมุนโรลเลอร์แคลมป์)
                                  // ทิ้งค่าเก่าทันที ไม่ให้ถ่วงจนตรวจจับช้า
    }
  }

  pushRateSample(now);
  float windowRate = rateFromWindow(df);
  if (windowRate > 0.0f) currentFlowRate_ml_hr = windowRate;

  hasFirstDropOccurred = true;
  skipNextInterval = false;
  lastDropTimestamp = now;
  currentGttMin = (currentFlowRate_ml_hr * (float)df) / 60.0f;
  totalVolumeMl = (float)totalDrops / (float)df;
}

// เรียกให้ถี่ที่สุดเท่าที่ทำได้ — countDrops = false ตอนหยุดชั่วคราวหรืออยู่หน้าตรวจเซนเซอร์
bool serviceDropSensor(bool countDrops) {
  sensorRaw = analogRead(SENSOR_AO_PIN);
  bool got = detector.update(sensorRaw, micros());
  if (got && countDrops) onDropDetected();
  return got;
}

const iv::DetectorStatus &det() { return detector.status(); }

// ข้อความสถานะที่พยาบาลอ่านแล้วรู้ว่าต้องทำอะไรต่อ — มีแค่ 4 แบบเท่านั้น
const char* sensorStateWord() {
  switch (det().lock) {
    case iv::Lock::Ready:    return "READY";
    case iv::Lock::Learning: return "LEARNING";
    case iv::Lock::NoDrops:  return "CHECK SENSOR";
    default:                 return "STARTING";
  }
}

uint16_t sensorStateColor() {
  switch (det().lock) {
    case iv::Lock::Ready:    return UI_GREEN;
    case iv::Lock::Learning: return COLOR_YELLOW;
    case iv::Lock::NoDrops:  return COLOR_RED;
    default:                 return THEME_SKYBLUE;
  }
}

// บันทึก/อ่านสิ่งที่เครื่องเรียนรู้ไว้ เพื่อให้เปิดเครื่องครั้งถัดไปพร้อมใช้เร็วขึ้น
void saveLearning() {
  stationPrefs.begin("st_cal", false);
  stationPrefs.putInt("lamp", det().learnedAmp);
  stationPrefs.putInt("lwid", det().learnedWidthMs);
  stationPrefs.putInt("pol",  detector.polarity());
  stationPrefs.end();
}

void loadLearning() {
  stationPrefs.begin("st_cal", true);
  int amp = stationPrefs.getInt("lamp", 0);
  int wid = stationPrefs.getInt("lwid", 0);
  int pol = stationPrefs.getInt("pol", 0);
  stationPrefs.end();
  if (pol == 1 || pol == -1) detector.setPolarity((int8_t)pol);
  else                       detector.setPolarityAuto();
  detector.seedLearning(amp, wid);
}

// ============================================================================
// หน้าตรวจเซนเซอร์ (กดปุ่มค้าง 3 วินาที) — ใช้ตอนติดตั้งหรือเวลาสงสัยว่าผิดปกติ
// ไม่มีขั้นตอนให้ทำตาม ไม่ต้องหยุดน้ำ ไม่ต้องกดยืนยันอะไร ดูอย่างเดียวแล้วกดออก
// ============================================================================
#define SCOPE_X            7
#define SCOPE_W            158
#define SCOPE_H            72
#define SCOPE_MS_PER_COL   16
#define SCOPE_TOP          64

