kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_7_3/ESP32-S3-Station-V_7_7_3.ino
int16_t scopeCol[SCOPE_W];
uint8_t scopeHead = 0;
int scopeColMax = 0;
int scopeFull = 200;
unsigned long scopeColStart = 0;

void scopeReset() {
  for (int i = 0; i < SCOPE_W; i++) scopeCol[i] = 0;
  scopeHead = 0; scopeColMax = 0; scopeColStart = millis();
}

void scopePush(int v) {
  if (v < 0) v = 0;
  if (v > scopeColMax) scopeColMax = v;
  unsigned long now = millis();
  if (now - scopeColStart < SCOPE_MS_PER_COL) return;
  scopeColStart = now;
  scopeCol[scopeHead] = (int16_t)scopeColMax;
  scopeHead = (uint8_t)((scopeHead + 1) % SCOPE_W);
  scopeColMax = v;
}

int scopeYof(int y, int value) {
  if (scopeFull < 20) scopeFull = 20;
  long h = (long)value * (SCOPE_H - 1) / scopeFull;
  if (h < 0) h = 0;
  if (h > SCOPE_H - 1) h = SCOPE_H - 1;
  return y + SCOPE_H - 1 - (int)h;
}

void scopeDraw(int y) {
  int thr = det().threshold;
  int peak = thr * 2;
  for (int i = 0; i < SCOPE_W; i++) if (scopeCol[i] > peak) peak = scopeCol[i];
  scopeFull = (peak * 12) / 10;
  if (scopeFull < 40) scopeFull = 40;
  int yThr = scopeYof(y, thr);

  for (int i = 0; i < SCOPE_W; i++) {
    // การวาดทั้งแถบใช้เวลาหลายสิบมิลลิวินาทีบนจอจริง ต้องแทรกการอ่านเซนเซอร์ไว้ด้วย
    // ไม่งั้นการวาดจอจะทำให้การอ่านขาดช่วงจนตรวจจับหยดไม่ได้
    if ((i % 12) == 0) serviceDropSensor(false);
    int x = SCOPE_X + i;
    int v = scopeCol[(scopeHead + i) % SCOPE_W];
    int yTop = scopeYof(y, v);
    if (yTop > y) tft.drawFastVLine(x, y, yTop - y, THEME_BG);
    if (yTop < y + SCOPE_H)
      tft.drawFastVLine(x, yTop, y + SCOPE_H - yTop,
                        (v >= thr) ? COLOR_YELLOW : THEME_SKYBLUE);
    if ((i % 4) < 2 && thr < scopeFull && yThr < yTop) tft.drawPixel(x, yThr, COLOR_ORANGE);
  }
}

void checkRow(int y, const String &label, const String &value, uint16_t col) {
  tft.fillRect(10, y, 152, 14, THEME_NAVY);
  textAt(label, 12, y, 1, UI_DIM, THEME_NAVY);
  textAt(value, 84, y, 1, col, THEME_NAVY);
}

void executeButtonCalibrationWizard() {
  noTone(BUZZER_PIN);
  buzzerBeepUntil = 0;

  tft.fillScreen(THEME_BG);
  tft.fillRect(0, 0, 172, 28, THEME_PINK);
  drawCenteredString("SENSOR CHECK", 8, 1, COLOR_WHITE, THEME_PINK);
  tft.fillRoundRect(6, 34, 160, 24, 6, THEME_NAVY);
  tft.drawRect(SCOPE_X - 1, SCOPE_TOP - 1, SCOPE_W + 2, SCOPE_H + 2, UI_LINE);
  tft.fillRoundRect(6, 146, 160, 140, 6, THEME_NAVY);
  drawCenteredString("CLICK = EXIT", 300, 1, UI_DIM, THEME_BG);
  scopeReset();

  unsigned long lastDraw = 0;
  String cacheState = "";
  uint32_t dropsAtEntry = det().drops;

  while (digitalRead(BTN_PIN) == HIGH) {
    serviceDropSensor(false);
    scopePush(det().edge);

    if (millis() - lastDraw >= 150) {
      lastDraw = millis();
      scopeDraw(SCOPE_TOP);

      String st = String(sensorStateWord());
      if (st != cacheState) {
        cacheState = st;
        tft.fillRect(8, 36, 156, 20, THEME_NAVY);
        drawCenteredString(st, 40, 2, sensorStateColor(), THEME_NAVY);
      }
      const iv::DetectorStatus &s = det();
      checkRow(152, "SIGNAL",  String(s.edge) + " / " + String(s.threshold), COLOR_WHITE);
      checkRow(170, "NOISE",   String(s.noiseSigma) + " adc  thr " + String(s.threshold), COLOR_WHITE);
      checkRow(188, "SNR",     String(s.snrX10 / 10) + "." + String(s.snrX10 % 10) + " x",
               (s.snrX10 >= 60) ? COLOR_GREEN : (s.snrX10 >= 30) ? COLOR_YELLOW : COLOR_ORANGE);
      checkRow(206, "DROP",    String(s.learnedAmp) + " adc  " + String(s.learnedWidthMs) + " ms", COLOR_WHITE);
      checkRow(224, "STEADY",  String(s.confidencePct) + " %", COLOR_WHITE);
      checkRow(242, "COUNTED", String(s.drops - dropsAtEntry), COLOR_WHITE);
      checkRow(260, "DIR",     String(detector.polarity() < 0 ? "drop = LOWER" : "drop = HIGHER"),
               detector.polarityLocked() ? UI_DIM : COLOR_YELLOW);
      checkRow(268 + 10, "ERR", "rej " + String(s.rejects) + "  gap " + String(s.gaps), UI_DIM);
    }
    delay(2);
  }

  modalSafeBeep(2400, 40);
  while (digitalRead(BTN_PIN) == LOW) delay(10);
  delay(60);

  saveLearning();
  if (hasFirstDropOccurred) { lastDropTimestamp = millis(); skipNextInterval = true; }
  lastUserActivityTime = millis();
  stateNeedsRedraw = true;
}

// ----------------------------------------------------------------------------
// ESP-NOW Receive Callback (รับ Sync จาก Host)
// ----------------------------------------------------------------------------
#if defined(ESP_IDF_VERSION) && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void OnTimeSyncRecv(const esp_now_recv_info_t *info, const uint8_t *incomingDataBytes, int len) {
  int rssi = (info && info->rx_ctrl) ? info->rx_ctrl->rssi : -55;
#else
void OnTimeSyncRecv(const uint8_t *mac, const uint8_t *incomingDataBytes, int len) {
  int rssi = -55;
#endif
  if (len != sizeof(struct_host_sync)) return;   // แพ็กเก็ตของ Station อื่น (22 bytes) จะถูกกรองออก

  struct_host_sync syncData;
  memcpy(&syncData, incomingDataBytes, sizeof(syncData));
  lastHostRssi = rssi;
  lastHostRecvTime = millis();
  isHostOnline = true;
  hostReportedChannel = syncData.hostChannel;

  if (syncData.epochTime > 1600000000) {
    struct timeval tv = { (time_t)syncData.epochTime, 0 };
    settimeofday(&tv, NULL);
    isClockSynced = (syncData.isSynced == 1);
  }

  if (syncData.stationId == currentStationId) {
    targetRateHr  = syncData.targetRateHr;
    totalPlanMl   = syncData.totalPlanMl;
    hostAlertCode = syncData.alertCode;
    dropFactor    = safeDropFactor(syncData.dropFactor);
    nearEndPct    = safeNearPct(syncData.nearEndPct);
    hostNearEndAck = (syncData.flags & 0x01) != 0;
    if (hostNearEndAck) nearEndAckRequest = false;   // Host ยืนยันแล้ว

    if (knownResetSeq < 0) {
      knownResetSeq = syncData.resetSeq;          // ครั้งแรกหลังบูต: รับค่าโดยไม่รีเซ็ต
    } else if (syncData.resetSeq != (uint8_t)knownResetSeq) {
      knownResetSeq = syncData.resetSeq;
      pendingCounterReset = true;                  // ให้ loop() เป็นผู้รีเซ็ต
    }
  }
}

void applyCounterReset() {
  pendingCounterReset = false;
  totalDrops = 0;
  periodDropsCounter = 0;
  totalVolumeMl = 0;
  currentFlowRate_ml_hr = 0;
  currentGttMin = 0;
  resetRateWindow();
  hasFirstDropOccurred = false;
  skipNextInterval = false;
  isDropFalling = false;
  snoozeUntilTime = 0;
  hostAlertCode = ALERT_NONE;
  hostNearEndAck = false;
  nearEndAckRequest = false;
  nearNextChimeTime = 0;
  nearChimeRemaining = 0;
  if (currentState == STATE_EMERGENCY || currentState == STATE_NEAR_END_NOTICE) currentState = STATE_NORMAL_VIEW;
  resetTrendData();                 // เริ่มถุงใหม่ = เริ่มกราฟแนวโน้มใหม่
  stateNeedsRedraw = true;
  beepNonBlocking(2400, 120);
}

// ----------------------------------------------------------------------------
// ค้นหาช่องสัญญาณของ Host
// ----------------------------------------------------------------------------
void setEspNowChannel(uint8_t ch) {
  if (esp_wifi_set_channel(ch, WIFI_SECOND_CHAN_NONE) == ESP_OK) {
    espnowChannel = ch;
  }
}

void manageChannelHunting(unsigned long now) {
  if (isHostOnline) {
    if (espnowChannel != savedChannel) {
      savedChannel = espnowChannel;
      stationPrefs.begin("st_cfg", false);
      stationPrefs.putUChar("ch", savedChannel);
      stationPrefs.end();
    }
    return;
  }
  if (now < CHANNEL_SCAN_START_MS) return;
  if (currentState == STATE_CONFIG_ID) return;

  if (now - lastChannelHopTime >= CHANNEL_SCAN_DWELL_MS) {
    lastChannelHopTime = now;
    uint8_t next = (espnowChannel % MAX_WIFI_CHANNEL) + 1;
    setEspNowChannel(next);
  }
}

